{"url": "https://aurora.tech", "type": "portfolio", "content": "Aurora: Self-driving freight is here. Freight Safety Company Newsroom Careers Schedule a call Schedule a call Self-driving freight is here. Experience Meet the Aurora Driver The Aurora Driver is designed to improve road safety and supply chain efficiency through self-driving freight technology. Built with cutting-edge hardware and powerful software backed by Verifiable AI, the Aurora Driver brings the benefits of autonomy into your fleet. And it’s here today. Now hauling customer loads in Texas. Meet the Aurora Driver. Our intelligent self-driving system. Designed to integrate directly into your existing freight operations and operate trucks nearly round-the-clock, the Aurora Driver can reliably deliver your loads on time. Launch the truck to haul a load with us. Side Pods Center Pod Onboard Computer Select feature Side Pods Center Pod Onboard Computer Previous Launch the truck Superhuman driving capabilities. Browse videos Planning Detecting a pedestrian running across the highway Planning Making space for aggressive drivers on the highway Planning Detecting and sharing the road with emergency vehicles You're in good company. “The early results of our pilot program with Aurora are impressive, particularly its ability to autonomously haul freight between Fort Worth and El Paso. The hybrid model of Werner professional drivers and the Aurora Driver will bring exemplary service to our customers while we continue to enhance the critical and long-haul routes that they demand.” Derek Leathers Chairman, President and CEO - Werner Enterprises “Freight volumes are projected to grow five fold between 2010-2050 making autonomous transport not just an innovation, but a necessity. This transformation is no small task and requires significant collaboration, which is why we have partnered with Aurora, whose Aurora Driver is seamlessly integrated into the Volvo VNL Autonomous.” Lars Stenqvist Executive Vice President, Group Trucks Technology and Volvo Group Chief Technology Officer “Do I feel safe with this technology around my family? Without hesitation, the answer is yes. We still have work to do educating the public. It’s extremely safe, vetted, and checked over and over.” Thomas Mrozinski Former Commercial Vehicle Enforcement - Frisco Police Department “Seeing what the truck is seeing is just insane. Humans can’t see this far. We can’t see this many angles all at once. Its turns were so on point… I was looking in the driver-side mirror—perfect turns. It used up the entire lane, kept it as wide as you possibly could. I was impressed by that because not a lot of drivers can do that.” C.L. - Million-Mile Driver Driver Ambassador - Hirschbach “Today’s CDLs are fantastic drivers, and the Aurora Driver is designed to perform like the best of them. The consistent strong performance of the self-driving system over millions of autonomous miles gives me confidence that autonomous trucks will make our supply chain safer and more efficient.” Karen Rasmussen Executive Director – Independent Carrier Safety Association Aurora Safety Advisory Board Member 01/05 Direct integration with major truck platforms. Road-tested hardware designed to be seamlessly integrated into autonomy-enabled redundant OEM trucks. Preparing to scale through partnerships with OEMs like Volvo and PACCAR, and strategic partners like Continental and NVIDIA. An 11 second advantage. The Aurora Driver, with proprietary FirstLight lidar that can see over 450 meters ahead, has the ability to spot and react to pedestrians up to 11 seconds sooner than human drivers at highway speeds at night. We invite you to learn more about how exceptional safety capabilities, strong product performance, and third-party experts guide our safety approach. Our approach to safety Detecting a pedestrian at night Watch 0:28 H u m a n P e r c e p t i o n A u r o r a P e r c e p t i o n News and stories from the road. Visit newsroom Company News Company News May 1, 2025 Aurora Begins Commercial Driverless Trucking in Texas, Ushering in a New Era of Freight Progress Progress March 31, 2025 Trust and Transparency: Aurora’s work with government leaders ahead of self-driving operations Progress Progress February 27, 2025 Have questions about Aurora and AVs? Get your answers here. Engineering Engineering June 13, 2024 Aurora’s Verifiable AI Approach to Self-Driving Your fleet. Fully optimized. Get in touch. Get on the road. Schedule a call Home Freight Safety Company Newsroom Careers Locations Bay Area, CA Bozeman, MT Dallas, TX Detroit, MI Louisville, CO Pittsburgh, PA Seattle, WA Our Company Aurora Driver Capabilities First Responders Investor Relations Contact Us Self-driving freight is here. Schedule a call All Rights Reserved ©2025 Aurora Operations, Inc. Privacy Policy Terms of Service Manage Your Data Cookie Settings LinkedIn YouTube X Instagram Facebook"}
