{"url": "https://www.instacart.com", "type": "portfolio", "content": "Instacart | Grocery Delivery or Pickup from Local Stores Near You Departments Food Pantry Seafood Baked goods Dairy Fresh produce Deli Frozen food Meat Meat alternatives Beverages Alcohol Wine Liquor Beer Coffee Juice Soda Tea Water Organic grocery More ways to shop Shop by location Shop online deals Send gifts Alcohol Convenience Ready meals Automotive Baby supplies Beauty products Clothing and apparel Electronics Flowers Furniture Health care Home and garden Household essentials Ice Office supplies Party supplies Personal care Pet supplies Sports and outdoors Help Contact Press Blog Help Careers Privacy Health Data Notice Terms Instacart+ Advertise on Instacart Partner program Gift cards Shoppers Shopper locations Promos & Coupons Grocery Budget Calculator Log in Sign up United States US CA Order groceries for delivery or pickup today Whatever you want from local stores, brought right to your door. Choose your store in Washington, DC Wag N' Wash Delivery New In-store prices Sam's Club Delivery by 6:15pm Harris Teeter Delivery by 6:15pm • Pickup Accepts EBT 1.4 mi away Harris Teeter Delivery Now Delivery by 5:25pm Accepts EBT Ideal for smaller orders Giant Food Delivery by 6:00pm Accepts EBT Giant Food Convenience Delivery by 5:45pm Accepts EBT Ideal for smaller orders Costco Delivery Accepts EBT ALDI Delivery by 6:30pm • Pickup Accepts EBT 1.7 mi away ALDI Express Delivery by 6:00pm Accepts EBT Ideal for smaller orders Walmart Delivery by 6:15pm In-store prices BJ's Wholesale Club Delivery by 6:30pm Accepts EBT Safeway Delivery by 6:00pm • Pickup Accepts EBT 5.5 mi away Show all Get the full Instacart experience Scan the QR code with your camera. First delivery is free. Main Grocery delivery you can count on Choose what you want Select items from your favorite grocery stores at Instacart.com or in the app. See real-time updates Personal shoppers pick items with care. Chat as they shop and manage your order. Get your items same-day Pick a convenient time for you. Enjoy Instacart’s 100% quality guarantee on every order. The largest online grocery marketplace in North America 1 billion products available to shop across the catalog 1 billion products available to shop across the catalog 80,000 stores from local grocers to chain stores 80,000 stores from local grocers to chain stores 14,000 cities served across the U.S. & Canada 14,000 cities served across the U.S. & Canada Millions of orders delivered or picked up yearly Millions of orders delivered or picked up yearly Common questions How does Instacart delivery and curbside pickup work? Instacart makes it easy to order from your favorite stores. Shop for items from stores near you, with a selection of more than 500 retailers and trusted local grocers across North America. Then, Instacart will connect you with a personal shopper in your area to shop and deliver your order. Contactless delivery is available with our “Leave at my door” option. You can track your order’s progress and communicate with your shopper every step of the way using the Instacart app or website. Instacart also offers curbside pickup at select retail locations. Simply place your order and choose a pickup time, and a shopper will prepare your order at the store. When you get to the store, use the Instacart app to notify us. Depending on the store, a shopper or store employee will bring the groceries to your car, or you can pick them up at the designated area. How much does Instacart cost? You don’t need a membership to order with Instacart. In fact, you can even order from warehouse clubs, like Costco, Sam’s Club, and BJ’s Wholesale Club, without a retailer club membership. To get started, create an account, select the store you want to shop, and place your order. New customers may be eligible for $0 delivery fees* promotions. (*Service fees apply) Delivery: Fees start at $3.99 for same-day orders over $35. Fees vary for one-hour deliveries, club store deliveries, and deliveries under $35. Pickup: There may be a “pickup fee” (equivalent to a delivery fee for pickup orders) on your pick up order. Service fees: Service fees vary and are subject to change based on factors like location and the number and types of items in your cart. Orders containing alcohol have a separate service fee. With an optional Instacart+ membership, you can get $0 delivery fees* on every order over $35. *Service fees apply. Will I pay the same price on Instacart as I would in store? Retail partners set the prices of items on the Instacart marketplace. While many retailers offer everyday store prices on Instacart, some retailers may set prices on the Instacart platform that are different from in-store prices. You can view pricing policies for each retailer on the Instacart app and website. What happens if something is out of stock and I need to give specific instructions? Instacart makes it easy to communicate with your shopper. When an item you want is out-of-stock at the store, your shopper will follow your replacement preferences. You can set item and delivery instructions in advance, as well as chat directly with your shopper while they shop and deliver your items. You can tell the shopper to: Find Best Match: By default, your shopper will use their best judgement to pick a replacement for your item. Pick Specific Replacement: You can pick a specific alternative for the shopper to purchase if your first choice is out-of-stock. Don’t Replace: For items you’d rather not replace, choose “Don’t replace” to get a refund if the item is out of stock. You can update or cancel your order as long as your shopper hasn’t started shopping. If you need to make changes after shopping has started, you can use the app or website to approve replacements or chat with your shopper. What happens if there's an issue with my order? If something isn’t right, you’ve got options. In the Instacart app or website, you can report: Missing items Incorrect items Damaged items Poor replacements Early/late orders If an order never came, or you get someone else’s order, you can reach out to Instacart Customer Experience. Can I get contactless delivery with Instacart? The health and safety of our community is our number one priority. We are excited to offer contactless delivery through our Leave at My Door delivery feature. Leave at My Door delivery gives you the flexibility to have your groceries delivered without having to come to the door or be at home. You can leave delivery instructions for your shopper at checkout, and we’ll notify you when your order arrives. Leave at My Door is now the default setting for all Instacart deliveries. If you’d prefer to not use this feature, simply uncheck the box that says “Leave at my door if I’m not around” at checkout. Customers who order alcohol, prescriptions, or certain high-value items may need to show ID upon delivery. We ask shoppers to wear masks whenever they come into contact with customers. Get deliveries with Instacart iOS Android Top departments Top departments Fresh Produce Dairy Products Meat Meat Alternatives Seafood Pantry Food Baked Goods View all departments Gift Delivery Near Me Flower Delivery Near Me Asian Groceries Business Office Food Coffee Shop Supplies Sprouts Farmers Market Weekly Ad Giant Eagle Weekly Ad More departments More departments Alcohol Alcohol by location Frozen Food Beverages Organic Grocery Household Essentials Office Supplies Beauty Products Late Night Delivery Grocery Pickup Near Me Latin Groceries Business Office snacks Safeway Weekly Ad Ingles Weekly Ad Food Lion Weekly Ad Employee Gifting Instacart programs Instacart programs Instacart+ Instacart Business EBT SNAP Fresh Funds Promos & Coupons Gift Cards Grocery Budget Calculator Instacart Ads Instacart Connect Cookie Delivery Near Me Business Office Supplies Schnucks Weekly Ad Instacart Weekly Ad Target Weekly Ad Costco Weekly Ad Get to know us Get to know us Press Careers Blog Ideas & Guides Help Shop By Location Beauty Supplies Near Me Pet Supplies Near Me Convenience Store Near Me Cake Delivery Near Me Caper Cart How Does Instacart Work Giant Weekly Ad Albertsons Weekly Ad ShopRite Weekly Ad Become a Shopper iOS Android Make money with us Make money with us Shopper Opportunities Become a Shopper In-Store Employee For Instacart Earnings Top cities Top cities Los Angeles New York City Chicago Washington D.C. San Francisco More cities More cities Miami Las Vegas Atlanta Dallas View all Job Locations Shopper help Shopper help Help Contact Safety Accessibility Enable high contrast colors Legal Terms of Use Privacy Policy Your Privacy Choices Apple and the Apple logo are trademarks of Apple Inc., registered in the U.S. and other countries. App Store is a service mark of Apple Inc. Android, Google Play and the Google Play logo are trademarks of Google LLC.\nTerms for Free Delivery (First Order): Offer valid on first order made through Instacart with a minimum basket size as set forth in the offer promotion. Offer expires on the date indicated in the user’s account settings or displayed in the offer promotion. View more details here."}
