{"url": "https://www.figma.com", "type": "portfolio", "content": "Figma: The Collaborative Interface Design Tool Skip to main content Products Solutions Community Resources Pricing Contact sales Log in Get started Get started for free Figma Design Design and prototype in one place Dev Mode Translate designs into code FigJam Collaborate with a digital whiteboard Figma Slides Co-create presentations Figma Draw New Illustrate with advanced vector tools Figma Buzz Beta Produce on-brand assets at scale Figma Sites Beta Publish fully responsive websites Figma Make Beta Prompt to code anything you can imagine AI Explore all Figma AI features Downloads Get the desktop, mobile,\u2028and font installer apps Release Notes See the latest features and releases Use cases Design systems Prototyping UX design Web design Wireframing Online whiteboard Team meetings Strategic planning Brainstorming Diagramming Product development Web development Design handoff Agile Roles Design Engineering Product managers Organizations Enterprise Education Config 2025 Register to join us in SF or online: May 6-8, 2025 Creator fund Build and sell what you love User groups Join a local Friends of Figma group Events Learn best practices at virtual events Customer stories Read about leading product teams Shortcut: The Figma blog Stories about how products take shape—and shape our world Get started Plugins UI kits Icons Widgets Templates Developer docs Partners See all Learn Best practices Reports & insights Resource library Demos Webinars Help center Contact sales Log in Get started Get started for free Products Figma Design Design and prototype in one place Dev Mode Translate designs into code FigJam Collaborate with a digital whiteboard Figma Slides Figma Draw New Figma Buzz Beta Figma Sites Beta Figma Make Beta AI Downloads Release Notes Solutions Use cases Design systems Prototyping UX design Web design Wireframing Online whiteboard Team meetings Strategic planning Brainstorming Diagramming Product development Web development Design handoff Agile Roles Design Engineering Product managers Organizations Enterprise Education Community Config 2025 Creator fund User groups Events Customer stories Resources Get started Plugins UI kits Icons Widgets Templates Developer docs Partners See all Learn Best practices Reports & insights Resource library Demos Webinars Help center Pricing Contact sales Get started Log in Think bigger. Build faster. Figma helps design and development teams build great products, together. Get started for free Design Draw Build Publish Promote Jam Present Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Design and refine products with your team, in one shared design file. Explore Figma Design Nearly everything that designers and developers need is available in Figma. Diana Mounter Head of Design Redesign how you design. Explore your ideas freely and iterate quickly. Generate simple UI with AI Instantly create mockups to explore a bigger option space. Learn more Design consistently with Auto Layout Make designs that automatically adjust to layout size—no more manually resizing. Scale your edits instantly Save time and effort by batch editing multiple frames at once, whether in a system or freeform. Make prototypes with AI Automatically create realistic prototypes for quick testing of your flows and interactions. Embed prototypes in your presentations Present playable, high-fidelity prototypes directly from your deck. Bring design and dev together. Easily translate designs into code with a workflow built for developers. 1 of 4 1/4 Design systems that scale. Streamline the product development process with a design system that’s aligned across design and code. Learn about design systems Built for building. Dev Mode is a dedicated space in Figma where developers can get what they need to turn designs into code. Learn about Dev Mode Focus on the details in Focus View. Select and inspect a specific design in Dev Mode, then dig into the details in Focus View so you know exactly what to build. Track progress with design statuses. Stay informed with clear design status updates on what’s changed, completed, or ready to build—all in Dev Mode. Build better products, together. Everything your team needs to brainstorm, design, and build. Create one source of truth. Everyone can collaborate seamlessly in one shared file. Designers, developers, copywriters—even external contractors and clients. Talk. Chat. Comment. Communicate via audio or chat to connect quickly within your file. Gather and keep track of feedback with comments. Figma helps us paint the north star for the whole company. It keeps everyone aligned and excited. Levon Sharrow Director of Experience Design Learn how to use Figma Figma Design: Beginner tutorial Intro to design systems Guide to FigJam Product Figma Design Dev Mode FigJam Figma Slides Figma Draw New Figma Buzz Beta Figma Sites Beta Figma Make Beta AI Downloads Release notes Plans Pricing Enterprise Organization Professional Use cases UI design UX design Wireframing Diagramming Prototyping Brainstorming Online whiteboard Agile Strategic planning Mind mapping Resources Blog Best practices QR code generator Color wheel Colors Color picker Color palettes Color palette generator Color contrast checker Templates Developers Integrations Affiliate program Resource library Reports and insights Support Status Legal and privacy Modern slavery statement Climate disclosure statement Compare Sketch Adobe XD Framer Miro Company About us Events Customers Careers Newsroom English English Deutsch Español (España) Español (Latinoamérica) Français Nederlands Polski Português (Brasil) 日本語 한국어"}
