{"url": "https://www.guardanthealth.com", "type": "portfolio", "content": "Guardant Health | Conquering Cancer With Data Skip to Main Content Approach Our Approach For Patients For Providers BioPharma Solutions Products Shield ™ Blood Test Guardant Complete® Guardant Infinity™ Clinical Studies Clinical Studies Key Publications News Newsroom Press Releases Stories and Perspectives Media Resources About Us Our Mission Leadership Careers For Investors Environmental, Social, and Governance Global Presence Contact Us 3100 Hanover Street Palo Alto, CA 94304 Contact Us Precision Oncology Learn how we are changing the future of cancer care. Our Approach For Patients For Providers BioPharma Solutions Products See how our blood tests are providing insights that can help patients at all stages of the disease. Shield ™ Blood Test Guardant Complete® Portfolio Guardant Infinity™ Clinical Studies View all of our screening, early-stage cancer, and advanced cancer clinical studies. Clinical Studies Key Publications Newsroom Read the latest news, announcements, and stories from Guardant Health. Newsroom Press Releases Stories and Perspectives Media Resources Our Company Get to know Guardant Health, our story, and our mission. Our Mission Leadership Careers For Investors Environmental, Social and Governance Global Presence Contact Us Your browser does not support the video tag. Conquering Cancer With Data Conquering Cancer With Data Through the power of blood tests, we can uncover clues that allow doctors to discover cancer early and find the best way to treat it. Explore Our Approach Scroll Down Our Solutions Blood Is at the Center of Transforming Cancer Care With over 500,000 of our blood tests performed by 12,000 doctors to date, our commercially available tests help inform treatment decisions for patients by holding insights that can improve clinical outcomes. SCREENING Learn More ONCOLOGY Learn More ONCOLOGY Learn More 1 2 3 Delivering on the Promise for Patients Precision oncology is redefining cancer care by driving a more personalized and data-driven approach that improves on traditional standards of care. From using biomarkers to inform treatment in advanced cancer, to using circulating tumor DNA to not only assess response to treatment, but detect signs of remaining cancer and even identify the earliest signs of cancer, precision oncology is helping patients across all stages of the disease. Our Commitment to Patients Featured Press Releases April 30, 2025 Guardant Health Reports First Quarter 2025 Financial Results and Increases 2025 Revenue Guidance April 28, 2025 Guardant Health Launches Guardant360 Tissue, First Tissue Molecular Profiling Test with Comprehensive Multiomic Analysis to Provide a More Complete View of Cancer April 24, 2025 Guardant Health Announces Strategic Collaboration With Pfizer to Support Development and Commercialization of New Cancer Therapies Using Guardant Infinity Smart Liquid Biopsy Platform See All Press Releases “Our focus is always on what will have the greatest impact on patients.” Helmy Eltoukhy, co-CEO Together We Can Help Conquer Cancer When you join our team, you become part of a mission that impacts so many personally: conquering cancer with data. We are passionate about serving patients and their families through the power of blood and the life-changing information it holds. We're hiring bright minds in diverse fields to solve some of the most profound challenges in human health today. Find Your Role 3100 Hanover Street Palo Alto, CA 94304 Contact Us Oncology Portal Shield ™ Provider Portal Approach Our Approach For Patients For Providers BioPharma Solutions Products Shield ™ Blood Test Guardant Complete® Guardant Infinity™ Clinical Studies Clinical Studies Key Publications News Newsroom Press Releases Stories and Perspectives Media Resources About Us Our Mission Leadership Careers For Investors Environmental, Social, and Governance Global Presence Contact Us Terms Privacy Policy HIPAA Notice California Notice at Collection Accessibility Your Privacy Choices Copyright © Guardant Health 2025 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept all”, you consent to the use of ALL the cookies. Furthermore, by clicking \"Accept all\", you are directing us to disclose your personal information to third parties for purposes of cross-contextual behavioral advertising. For more information, please refer to our privacy policy . Cookie Settings Reject All Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Save & Accept"}
