{"url": "https://www.lyft.com", "type": "portfolio", "content": "Ride or drive with Lyft Skip to main content Get a ride DRIVER RIDER business LOG IN SIGN UP EN Let's ride No matter where you’re headed, we’ll help you get there. On-demand, scheduled ahead, late night, or morning commute.  Plus, get rewards on every ride. Sign up to ride Drive and earn your way With Lyft, you can be your own boss, set your own schedule, and drive when it makes sense for you. You keep 100% of your tips, and can cash out instantly whenever you want. Apply to drive Learn more about earnings RIDE WITH LYFT Ready, set, go in just a few quick taps RIDE WITH LYFT Ready, set, go in just a few quick taps No matter your destination, we’ll get you where you need to go Get a reliable ride in minutes Schedule your ride in advance Earn rewards on every ride Sign up to ride Learn more about riding with Lyft We’re rolling out the red carpet We’re rolling out the red carpet Join the new Lyft Pink to enjoy complimentary upgrades to Priority Pickup, exclusive savings, and preferential pricing on Lux, XL, and Preferred rides. Members save an average of $23/month. Free Priority Pickup upgrades Get picked up faster and save $3-4 per ride on average Exclusive savings Enjoy 5% off on Extra Comfort and Lyft XL rides Cancellation forgiveness Cancel up to 3x/month for free Free Grubhub+ for a year $0 restaurant delivery fees Join now Subject to the Lyft Pink Terms & Conditions and Lyft Terms of Service . Rides you can count on We’ve got options to get you where you’re going. Choose a ride that suits your mood and budget.* Wait & Save Budget-friendly Private Lyft Efficient Private Priority Pickup Efficient Private Bikes & Scooters Efficient Eco-friendly Extra Comfort Roomier cars Top drivers Black Luxury cars Top drivers Black SUV Luxury cars Extra Seats XL Extra seats Private *Availability of bikes, scooters, and ride types varies by region. Accelerate your business Provide reliable rides for the people who matter to your business. Whether it’s team members heading into work or clients flying into town. Get started today Explore solutions Your safety's first. Always. Protecting riders and drivers is priority number one. That’s why we have a rigorous vetting process for drivers, strict community standards, and more. Learn more Community guidelines Making rides more accessible A ride is more than just transportation: It's access to job opportunities, community events, and essentials like groceries and healthcare. Lyft Up makes rides more accessible, bringing communities closer. Learn more about our Lyft Up programs Download the apps and get going! Scan the QR code to download. Download the rider app Scan the QR code to download. Download the driver app DRIVER DRIVER Become a Driver New Driver Guide Earnings Cities Help Safety Application Requirements Express Drive Bonus Lyft Rewards Go Electric Insurance Black Car Fleets Driver Blog Beta Program RIDER RIDER Sign up to ride Lyft Pink Cities Help Safety Business Profile Rewards Events Airports Gift Cards Lyft Family Shuttles & Buses Donate LYFT LYFT Careers Lyft Up Business Healthcare Bikes Scooters Autonomous Lyft Media Venue Partnerships Developers Newsroom Press Investor Relations Lyft driver app Lyft rider app EN Terms Privacy Accessibility Statement Your Privacy Choices © 2025 Lyft, Inc. CPUC ID No. TCP0032513-P"}
