{"url": "https://www.apple.com", "type": "portfolio", "content": "Apple Apple Apple Store Mac iPad iPhone Watch Vision AirPods TV & Home Entertainment Accessories Support 0 + iPhone Meet the iPhone 16 family. Learn more Shop iPhone Built for Apple Intelligence. Mother’s Day It’s not too late to find the perfect gift for Mom. Shop Apple Watch Live healthier. Train better. Stay connected. Learn more Shop Watch Apple Watch Show your stripes with the new Pride Edition Sport Band. Buy MacBook Air Sky blue color. Sky high performance with M4. Learn more Buy Built for Apple Intelligence. College Students Mac and iPad. Major. In any field. Learn more iPad Air Now supercharged by the M3 chip. Learn more Buy Built for Apple Intelligence. Apple Trade In Get $170–$630 in credit when you trade in iPhone 12 or higher. 1 Get your estimate Apple Card Get up to 3% Daily Cash back with every purchase. Learn more Apply now Apply now Apple TV+ FAM Gallery Watch now Strong and Calm Combos for Busy Days Listen now Seth Rogen: The Zane Lowe Interview Play now PGA TOUR Pro Golf Watch now Strength with Gregg Listen now A-List Pop Play now Balatro+ Apple Footer 1. Trade‑in values will vary based on the condition, year, and configuration of your eligible trade‑in device. Not all devices are eligible for credit. You must be at least the age of majority to be eligible to trade in for credit or for an Apple Gift Card. Trade‑in value may be applied toward qualifying new device purchase, or added to an Apple Gift Card. Actual value awarded is based on receipt of a qualifying device matching the description provided when estimate was made. Sales tax may be assessed on full value of a new device purchase. In‑store trade‑in requires presentation of a valid photo ID (local law may require saving this information). Offer may not be available in all stores, and may vary between in‑store and online trade‑in. Some stores may have additional requirements. Apple or its trade‑in partners reserve the right to refuse, cancel, or limit quantity of any trade‑in transaction for any reason. More details are available from Apple’s trade-in partner for trade‑in and recycling of eligible devices. Restrictions and limitations may apply. To access and use all Apple Card features and products available only to Apple Card users, you must add Apple Card to Wallet on an iPhone or iPad that supports and has the latest version of iOS or iPadOS. Apple Card is subject to credit approval, available only for qualifying applicants in the United States, and issued by Goldman Sachs Bank USA, Salt Lake City Branch. Apple Payments Services LLC, a subsidiary of Apple Inc., is a service provider of Goldman Sachs Bank USA for Apple Card and Savings accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank. If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card. Learn more about how Apple Card applications are evaluated at support.apple.com/kb/HT209218 . Major League Baseball trademarks and copyrights are used with permission of MLB Advanced Media, L.P. All rights reserved. Apple Intelligence is available in beta on all iPhone 16 models, iPhone 15 Pro, iPhone 15 Pro Max, iPad mini (A17 Pro), and iPad and Mac models with M1 and later, with Siri and device language set to Chinese (Simplified), English (Australia, Canada, India, Ireland, New Zealand, Singapore, South Africa, UK, or U.S.), French, German, Italian, Japanese, Korean, Portuguese (Brazil), or Spanish, as part of an iOS 18, iPadOS 18, and macOS Sequoia software update, with more languages coming over the course of the year, including Vietnamese. Some features may not be available in all regions or languages. A subscription is required for Apple Arcade, Apple Fitness+, Apple Music, and Apple TV+. Features are subject to change. Some features, applications, and services may not be available in all regions or all languages. Shop and Learn Shop and Learn Store Mac iPad iPhone Watch Vision AirPods TV & Home AirTag Accessories Gift Cards Apple Wallet Apple Wallet Wallet Apple Card Apple Pay Apple Cash Account Account Manage Your Apple Account Apple Store Account iCloud.com Entertainment Entertainment Apple One Apple TV+ Apple Music Apple Arcade Apple Fitness+ Apple News+ Apple Podcasts Apple Books App Store Apple Store Apple Store Find a Store Genius Bar Today at Apple Group Reservations Apple Camp Apple Store App Certified Refurbished Apple Trade In Financing Carrier Deals at Apple Order Status Shopping Help For Business For Business Apple and Business Shop for Business For Education For Education Apple and Education Shop for K-12 Shop for College For Healthcare For Healthcare Apple in Healthcare Mac in Healthcare Health on Apple Watch Health Records on iPhone and iPad For Government For Government Shop for Government Shop for Veterans and Military Apple Values Apple Values Accessibility Education Environment Inclusion and Diversity Privacy Racial Equity and Justice Supply Chain About Apple About Apple Newsroom Apple Leadership Career Opportunities Investors Ethics & Compliance Events Contact Apple More ways to shop: Find an Apple Store or other retailer near you. Or call 1-800-MY-APPLE (1-800-692-7753). United States Copyright ©\n\t\t\t\t\n\t\t\t\t2025\n\t\t\t\t Apple Inc. All rights reserved. Privacy Policy Terms of Use Sales and Refunds Legal Site Map"}
