{"url": "https://www.asana.com", "type": "portfolio", "content": "Manage your team’s work, projects, & tasks online • Asana Start seeing real results from AI. Join Asana experts for an interactive session on how to scale AI effectively across your organization. Register for webinar x icon Asana Home Product chevron-down icon Solutions chevron-down icon Resources chevron-down icon Pricing Choose your preferred language Bahasa Indonesia Deutsch English Español Français Italiano 日本語 한국어 Nederlands Polski Português Русский Svenska 繁體中文 Contact sales Log In Get started Product chevron-down icon PLATFORM Product overview Asana AI All features Latest feature release CAPABILITIES asana-intelligence icon AI Studio goal icon Goals and reporting portfolio icon Resource management apps icon App integrations project icon Project management workflow icon Workflows and automation my-task icon Admin and security ALL PLANS list icon Personal premium icon Starter briefcase icon Advanced Solutions chevron-down icon Company Type Enterprise Small business Nonprofit Teams Operations Marketing IT Leaders Industries Healthcare Retail Financial Services Education Manufacturing Use Cases Goal management Organizational planning Project intake Resource planning Product launches View all use cases arrow-right icon Resources chevron-down icon Learn Help Center Asana Academy Certifications Forums Discover Work management hub Customer stories Events SUPPORT & SERVICES Get support Developer support Partners Customer success Templates Project plans Team goals & objectives Team continuity Meeting agenda View all templates arrow-right icon Pricing Get started Get started Log In Launch Asana Contact sales View demo Download app PLATFORM Product overview Asana AI All features Latest feature release CAPABILITIES asana-intelligence icon AI Studio goal icon Goals and reporting portfolio icon Resource management apps icon App integrations project icon Project management workflow icon Workflows and automation my-task icon Admin and security ALL PLANS list icon Personal premium icon Starter briefcase icon Advanced Company Type Enterprise Small business Nonprofit Teams Operations Marketing IT Leaders Industries Healthcare Retail Financial Services Education Manufacturing Use Cases Goal management Organizational planning Project intake Resource planning Product launches View all use cases arrow-right icon Learn Help Center Asana Academy Certifications Forums Discover Work management hub Customer stories Events SUPPORT & SERVICES Get support Developer support Partners Customer success Templates Project plans Team goals & objectives Team continuity Meeting agenda View all templates arrow-right icon Contact sales View demo Download app Where your teams and AI coordinate work together See how your work connects to goals while working alongside AI that understands your business. Get started See how it works 85% of Fortune 100 companies choose Asana¹ See how Asana keeps work moving across use cases Campaign management Plan, track, and complete your campaigns all in one place. See campaign management arrow-right icon Creative production Accelerate creative work by automating workflows from start to finish. See creative production arrow-right icon Project intake Capture, prioritize, and assign requests automatically so your teams have more time to work. See project intake arrow-right icon Product launches Coordinate teams, tasks, and timelines to keep every launch on schedule. See project launches arrow-right icon Organizational planning Address business needs quickly by analyzing progress, bandwidth, and blockers on one platform. See organizational planning arrow-right icon Resource planning Visualize how teams are staffed and what resources are available across your business. See resource planning arrow-right icon Goal management Connect everyone's work to the organizational goals they support. See goal management arrow-right icon Employee onboarding Standardize onboarding to help new employees make an impact quickly. See employee onboarding arrow-right icon Scroll carousel back Scroll carousel forward What sets Asana apart More clarity and accountability Connect strategic goals to the teams that help achieve them. Keep your company on track with AI working alongside your teams. Learn about goals Amplify your impact with AI Let Asana AI handle work for you—with the full context of your business—so your teams can achieve their goals faster. Meet Asana AI Connect over 300+ integrations Asana connects with the enterprise tools your organization already uses, right out of the box. See all integrations The world’s top companies trust Asana See all case studies Company Size Enterprise Industry Food/Hospitality Asana makes everything shareable, which saves us time executing programs because it’s so much easier to replicate and learn from what others have done. Simon Levinson Global Digital Manufacturing Process Innovation Manager, Danone arrow-right icon Read case study Company Size Mid-Market Industry Retail / Fast-Moving Consumer Goods (FMCG) To hit our ambitious growth target, we need to move fast. But we can’t do it without clear processes that remove as many blockers as possible. I'm a strong believer that implementing processes, like the ones we built in Asana, will help us drive success. Romain Ehrhard CIO, KENDO arrow-right icon Read case study Company Size Enterprise Industry Technology Asana is our air traffic control. We have the visibility to scale production and support a higher number of ad campaigns to support our revenue goals. Eugenia Contreras Associate Manager, Spotify arrow-right icon Read case study Company Size Enterprise Industry Media Having one centralized ecosystem that brings all doers and stakeholders together has really accelerated our understanding of the work we do and the speed in which we do it. Steven Tai Director, Marketing Operations, Gannett arrow-right icon Read case study 1 2 3 4 Get started easily Tour the platform, read a few deep dives, or kickstart your work management journey with the right template. Try the Asana demo See Asana in action arrow-right icon Discover resources Help articles and tutorials arrow-right icon Start with a template Get started faster with a template arrow-right icon Recognized as a leader by top analyst firms A Leader in the Gartner Magic Quadrant for Collaborative Work Management² two years in a row Learn more arrow-right icon A Leader in the The Forrester Wave™: Collaborative Work Management Tools Report³ Learn more arrow-right icon A Leader in the IDC MarketScape: Worldwide Collaborative Work Management Vendor Assessment⁴ The only platform that can support your company at any scale Get started 1. Accurate as of December 2023, includes free and paid users. 2. See the 2024 Gartner® Magic Quadrant™ for Collaborative Work Management (CWM) . GARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, MAGIC QUADRANT and PEER INSIGHTS are registered trademarks and The GARTNER PEER INSIGHTS CUSTOMERS’ CHOICE badge is a trademark and service mark of Gartner, Inc. and/or its affiliates and is used herein with permission. All rights reserved. 3. See The Forrester Wave™: Collaborative Work Management Tools, Q4 2022 report . The Forrester Wave: Collaborative Work Management Tools, Q4 2022. The Forrester Wave is copyrighted by Forrester Research, Inc. Forrester and Forrester Wave are trademarks of Forrester Research, Inc. The Forrester Wave is a graphical representation of Forrester’s call on a market and is plotted using a detailed spreadsheet with exposed scores, weightings, and comments. Forrester does not endorse any vendor, product, or service depicted in the Forrester Wave. Information is based on best available resources. Opinions reflect judgment at the time and are subject to change. 4. IDC MarketScape: Worldwide Collaborative Work Management 2023–2024 Vendor Assessment — Uniting Teams, Data, and AI for Flexible Work, Doc #US49434923, December 2023 Asana Home New to Asana? Product overview All features Latest feature release Pricing Starter plan Advanced plan Enterprise App integrations AI work management Project management Resource management Use cases Campaign management Content calendar Creative production Goal management New hire onboarding Organizational planning Product launches Resource planning Strategic planning Project intake All use cases Solutions Marketing Operations IT Product Sales Healthcare Retail Education Nonprofits All teams Resources Help Center Get support Asana Academy Certifications Forum Resource hub Project templates Events Customer Success Developers and API Partners Sitemap Company About us Leadership Customers Careers Inside Asana Diversity Press Investor relations Trust and security Privacy Supplier responsibility Sustainability and ESG © 2025 Asana, Inc. Language Bahasa Indonesia Deutsch English Español Français Italiano 日本語 한국어 Nederlands Polski Português Русский Svenska 繁體中文 X Linkedin Instagram Facebook Youtube Terms Terms & Privacy Privacy Download the Asana iOS app Download the Asana Android app"}
