{"url": "https://www.boringcompany.com", "type": "portfolio", "content": "The Boring Company Tunnels Prufrock Projects Loop Careers Flamethrower Burnt Hair Tunnels Prufrock Projects Loop Accelerate Civilization With Subterranean Technology Careers Flamethrower Burnt Hair Scroll The Boring Company creates safe, fast-to-dig, and low-cost transportation, utility, and freight tunnels The mission: solve traffic, enable rapid point-to-point transportation and transform cities Why Tunnels? To solve the problem of soul-destroying traffic, roads must go 3D, which means either flying cars or tunnels are needed. Unlike flying cars, tunnels are weatherproof, out of sight, and won't fall on your head. Tunnels minimize usage of valuable surface land and do not conflict with existing transportation systems. A large network of tunnels can alleviate congestion in any city; no matter how large a city grows, more levels of tunnels can be added. Learn more introducing loop Loop is an all-electric, zero-emissions, underground public transportation system in which passengers are transported directly to their final destination with no stops along the way. Located at the Las Vegas Convention Center, LVCC Loop is the first commercially operating Loop system. Learn more Meet Prufrock Prufrock is designed to construct mega-infrastructure projects in a matter of weeks instead of years Prufrock is designed to tunnel at a speed of 1 mile per week, which is 6 times faster than The Boring Company’s previous generation TBM (Godot-Plus). This is still 4-5 times slower than a garden snail...but Prufrock is catching up! Learn more Join Us We're looking for talented individuals ready to get their hands dirty to make a meaningful impact that will last for generations to come. We are an equal opportunity employer offering competitive salaries, comprehensive health benefits, and equity packages. Careers Home Why Tunnels What Is Loop Meet Prufrock Join Return to Top Contact X LinkedIn Careers © 2025 The Boring Company. All Rights Reserved."}
