{"url": "https://www.salesforce.com", "type": "portfolio", "content": "Salesforce: The Customer Company | Salesforce US Skip to content Grow faster and work smarter. Start simply with Starter Suite, the all-in-one CRM for small business. Then scale endlessly with autonomous AI agents, unified data, and CRM apps together on one integrated platform. And connect with customers in a whole new way. Try for free Watch demos Create a limitless workforce. With Agentforce. Create a digital labor force that works alongside your human workforce. AI agents  work 24/7, taking action and providing support to employees and customers. Free your people to be more productive, so they can focus on more important stuff. Explore Agentforce Calculate your ROI Start simply. Scale endlessly. See results on day one with Starter Suite. Our all-in-one small business solution, Starter Suite , brings sales, service and marketing tools together on a single, easy-to-use app. There’s nothing to install. Just enter your details and get going, right in your browser. $25 USD/user/month See full pricing Try for free Lead, Contact, and Opportunity Management Capture and track customer data from any source. Keep your team on track with built-in deal stages. Get recommended next steps to move deals along the pipeline. Email Marketing Use AI to create segments, draft a campaign brief, build the campaign, and write an email — all in just a few minutes. Service Case Management Unify all your support channels with a single, shared view. Route cases to the best agent or technician for the job, set priorities, and close more cases. Reporting and Analytics Get a real-time view of your business with custom dashboards. Get pre-loaded data to start forecasting from day one, then tailor it to your business over time. Keep growing with the world's #1 AI CRM. Agentforce Build and customize autonomous AI agents to support your employees and customers 24/7. Explore Agentforce Small Business Help small businesses sell smarter and support faster in a single app. Explore Small Business Sales Connect teams, close more deals, and simplify your sales process. Explore Sales Service Manage customer support cases faster across every channel. Explore Service Marketing Easily build, personalize, and optimize campaigns and journeys. Explore Marketing Commerce Engage buyers online and in-store with B2C and B2B commerce. Explore Commerce Artificial Intelligence Bring predictive and generative AI experiences to any workflow, user, department, or industry. Explore AI Data Cloud Unify all your data to power personalized engagement at scale. Explore Data Cloud Salesforce Platform Connect your teams and data with apps built in clicks, not code. Explore Salesforce Platform Slack Bring agentic productivity to every team with one work operating system. Explore Slack Tableau Get powerful insights from any data, anytime, anywhere. Explore Tableau MuleSoft Connect any app, data, or device — in the cloud or on-premises. Explore MuleSoft Heroku Build scalable apps on a cloud-based platform made for developers. Explore Heroku Success and Services Maximize your ROI with self-service resources and trusted guidance from our CRM, AI, and data experts. Explore Success and Services See all pricing Find the right solution for your company – any size, any industry. Financial Services Unlock the most valuable currency: customer trust. Learn more Retail Acquire profitable customers faster with unified, real-time data. Learn more Healthcare & Life Sciences Build stronger patient and member relationships on a connected platform. Learn more Construction & Real Estate Streamline processes and achieve operational excellence to drive profitability and growth. Learn more Education Elevate the education experience with the #1 AI CRM for learner and institution success. Learn more Professional Services Increase client trust, recruit and retain the right talent, and build a vibrant work culture. Learn more Technology Automate workflows, unify and integrate data, and thrive in a new era of tech, powered by trusted AI. Learn more Manufacturing Integrate all your data across a unified value chain to better serve customers and channel partners. Learn more See all industries What is Salesforce? Salesforce brings together all your data, from any source, so you can act on it with trusted AI and automation, all on one integrated CRM platform. It makes it easy to find more prospects, close more deals, and connect with customers in a whole new way. So it’s little wonder Salesforce was named the world’s #1 CRM for 11 years running. Let’s make this easy. Get up and running quickly. Get started with Starter Suite, the all-in-one CRM app for marketing, sales, and service. Try for free 1. Set up and start. There’s nothing to install. Simply enter your details and you’re ready to get going, right in your browser. 2. Connect email and sync contacts. Sync your email and calendar in a few clicks. You’ll automatically capture and sync all your data to Salesforce, and use CRM features right where you work. 3. Bring in your data. Import spreadsheets and connect to data sources like Google. In-app guides make sure you have clean data imported in minutes. Integrate seamlessly. Salesforce works with thousands of partner apps and certified consultants to help you extend Salesforce and boost productivity. All are easily discoverable on AppExchange , the leading enterprise cloud marketplace and home to over 9,000 solutions. Need to connect outside systems? We’ve got you covered with MuleSoft , our API platform. Browse all apps Solve problems quickly. Your success is our top priority. Whatever solution you choose, it comes with free one-day ticketing and Salesforce alert monitoring, right out of the box. Need more support? We have a variety of Success Plans and Professional Services offering resources, expert guidance, and the tech support you need to get the most value from Salesforce. Included with all product licenses: Learn as you grow. When you’re ready to get up and running on Salesforce, we have all sorts of people and free resources to help your teams quickly get up to speed. And we’re always here for you with more learning and support as you continue to grow with Salesforce. Trailhead Help every employee get the Salesforce skills they need. Learn for free Salesforce+ Learn more about products at live and on-demand events. Explore events AppExchange Get the most out of Salesforce with partner apps and experts. Explore partners Community Connect with our customers, partners, and product experts. Explore Trailblazer Community Don't just take our word for it. See how our customers work smarter, drive automation, and grow revenue. Companies around the globe see eye-popping results with Salesforce. You can, too. Ennube saves time with AI-generated emails. Read the Ennube story > Algo cuts call times with Salesforce automation. Read the Algo story > Inter boosts ROI by personalizing every banking experience. Read the Inter story > Hear what the top voices in the industry have to say. See all reports Salesforce is voted the #1 Global Software Company on G2. Get the report New Valoir research reveals how businesses scale AI agents 16x faster with Agentforce. Get the report Futurum report explains why Agentforce is the fastest path to enterprise value. Get the report Get started today. There's nothing to install. No credit card required. Free for 30 days. Try for free"}
