{"url": "https://www.affirm.com", "type": "portfolio", "content": "Affirm | Buy now, pay later with no late fees or surprises This app works best with JavaScript enabled. We're glad you're here! Would you like to see what Affirm offers in your region? Go to the  page Stay here Skip to main content For shoppers For businesses What is Affirm How to use Shop Affirm Cardâ\u0084¢ Log in Sign up Help Log in United States Australia Canada (En) Canada (Fr) United States United Kingdom For shoppers How it works Affirm Cardâ\u0084¢ Affirm Moneyâ\u0084¢ Help For businesses Get started Solutions Partner directory For developers Business support About Affirm About us Careers Investors Press Security Affirm Cares Diversity & inclusion Payment options through Affirm are provided by these lending partners: affirm.com/lenders . Your rate will be 0%â\u0080\u009336% APR based on credit, and is subject to an eligibility check. Affirm Pay in 4 payment option is 0% APR. Options depend on your purchase amount, may vary by merchant, and may not be available in all states. A down payment may be required. For example, at a purchase price of $800 you could pay a down payment of $160 today, followed by 12 monthly payments of $57.77 at 15% APR or 4 interest-free payments of $200 every 2 weeks. The Affirm Money â\u0084¢ Account is held with Cross River Bank (CRB), Member FDIC. Affirm is not a bank. FDIC insurance covers accounts held with CRB in the event CRB fails. California residents: Affirm Loan Services, LLC is licensed by the Department of Financial Protection and Innovation. Loans are made or arranged pursuant to California Financing Law license 60DBO-111681. The Affirm Card is a VisaÂ® debit card issued by Evolve Bank & Trust (Evolve), Member FDIC, pursuant to a license from Visa U.S.A. Inc. Affirm is not a bank. FDIC insurance will only cover the failure of Evolve. Learn more . The Affirm Card is not available to residents of U.S. territories. The one-time-use Affirm virtual card is issued by CRB, Sutton Bank, Member FDIC, or Celtic Bank, pursuant to a license from Visa U.S.A. Inc. Affirm, Inc., NMLS ID 1883087. Affirm Loan Services, LLC, NMLS ID 1479506. For licenses and disclosures, see affirm.com/licenses . Privacy Your California privacy choices Terms Licenses Â© Affirm, Inc. All Rights Reserved."}
